In [ ]:
#Task 9:Add the cost of all projects for each Employee and save it in new dataframe
#“TotalProjCost” with three columns ID, First Name, and Total cost

In [38]:
import pandas as pd    # importing pandas
path= "C:\\Users\\Mohini\\PY-Capstone\\promote.csv"  #reading the "promote" csv file
df = pd.read_csv(path, index_col=0)

In [39]:
pd.options.display.float_format = '{:.0f}'.format    # Disable scientific notation
TotalProjCost=df

In [40]:
# Grouping by ID and First Name, then summing the Cost
TotalProjCost = TotalProjCost.groupby(["ID", "First Name"], as_index=False)["Cost"].sum()

# Renaming the "Cost" column to "Total Cost"
TotalProjCost.rename({"Cost": "Total Cost"}, inplace=True)

In [41]:
TotalProjCost

     ID  First Name    Cost
0  A001   Mrs. John 3478667
1  A002  Mrs. Alice 2680000
2  A003    Mrs. Tom 5150000
3  A004   Mrs. Nina 9500000
4  A005    Mrs. Amy 4600000

In [42]:
TotalProjCost.to_csv("TotalProjCost.csv")

In [43]:
#Task 10: Print all the employee details whose city name contains the letter “o” in it

In [44]:
# Filtering employees where the City name contains "o"

# using the above "df" dataframe for filtering
df = df[df["City"].str.contains("o")]
df

,ID,Project,Cost,Status,City,Age,First Name,Last Name,Designation Level,Bonus
3,A002,Project 2,2000000,Ongoing,London,27,Mrs. Alice,Luxumberg,2,0
4,A002,Project 6,680000,Failed,London,27,Mrs. Alice,Luxumberg,1,0
8,A004,Project 4,5500000,Ongoing,Newyork,31,Mrs. Nina,Adgra,3,0
9,A004,Project 12,1000000,Ongoing,Newyork,31,Mrs. Nina,Adgra,3,0
10,A004,Project 13,3000000,Finished,Newyork,31,Mrs. Nina,Adgra,3,150000

In [45]:
print(df) # Printing the result

      ID     Project    Cost    Status     City  Age  First Name  Last Name  \
3   A002   Project 2 2000000   Ongoing   London   27  Mrs. Alice  Luxumberg
4   A002   Project 6  680000    Failed   London   27  Mrs. Alice  Luxumberg
8   A004   Project 4 5500000   Ongoing  Newyork   31   Mrs. Nina      Adgra
9   A004  Project 12 1000000   Ongoing  Newyork   31   Mrs. Nina      Adgra
10  A004  Project 13 3000000  Finished  Newyork   31   Mrs. Nina      Adgra

    Designation Level  Bonus
3                   2      0
4                   1      0
8                   3      0
9                   3      0
10                  3 150000